<a href="https://colab.research.google.com/github/nhwhite212/DealingwithDataSpring2021/blob/master/mysql_colab_client.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Connecting to a remote mysql database from COLAB**
#### This notebook has examples of how to connect to remote mysql databases from google colab:
## It will first connect to the Panos Ipeirotis Mysql Server which houses a number of sample databases. This server is actually running in the Googe Cloud. We only have read-only access to it, so we can't add databases or create and modify databases.
### The second server is running in the Stern Cloud, and is also a mysql server.
####  Each team will get an account on this server, so they can create and store tables.

## First, make sure all the required software is installed.
### We need to install the linux mysqlclient libraries on our linux system, and the  python mysqlclient libraries are installed
#### Unfortunately, we need to do this for every colab session.

In [3]:
# install the required linux support needed by the python libraries
!sudo apt-get install python3-dev default-libmysqlclient-dev
# Next install the python mysql support
!pip install mysqlclient

Reading package lists... Done
Building dependency tree
Reading state information... Done
default-libmysqlclient-dev is already the newest version (1.0.4).
python3-dev is already the newest version (3.6.7-1~18.04).
0 upgraded, 0 newly installed, 0 to remove and 15 not upgraded.
Requirement already satisfied: mysqlclient in /usr/local/lib/python3.6/dist-packages (2.0.3)

In [4]:
# We also need the sqlalchemy package for python
!pip3 install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (1.3.20)

## Then , we should be able to use familiar tools

In [5]:
from sqlalchemy import create_engine

In [6]:
conn_string_imdb = 'mysql://{user}:{password}@{host}:{port}/{db}?charset=utf8'.format(
    user='student', 
    password='dwdstudent2015', 
    host = 'db.ipeirotis.org', 
    port=3306, 
    db='imdb',
    encoding = 'utf-8'
)
engine_imdb = create_engine(conn_string_imdb)

### next install the sql magic code python library .
### so we can type sql queries in a code cell

In [7]:
!sudo pip install sql_magic

Collecting sql_magic
  Downloading https://files.pythonhosted.org/packages/a6/a7/ccdc67278de3f34db5d484f9b6c59ad9a536beda4a5acad5ecb3b0932246/sql_magic-0.0.4-py3-none-any.whl
Requirement already satisfied: ipython in /usr/local/lib/python3.6/dist-packages (from sql_magic) (5.5.0)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.6/dist-packages (from sql_magic) (0.4.1)
Requirement already satisfied: traitlets in /usr/local/lib/python3.6/dist-packages (from sql_magic) (4.3.3)
Collecting findspark
  Downloading https://files.pythonhosted.org/packages/fc/2d/2e39f9a023479ea798eed4351cd66f163ce61e00c717e03c37109f00c0f2/findspark-1.4.2-py2.py3-none-any.whl
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.1.5)
Requirement already satisfied: jupyter in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.0)
Requirement already satisfied: decorator in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.4.2)
Requirement already satisfied: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.8.1)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (1.0.18)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (51.0.0)
Requirement already satisfied: pygments in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (2.6.1)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (1.15.0)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (1.19.4)
Requirement already satisfied: jupyter-console in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.2.0)
Requirement already satisfied: notebook in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.3.1)
Requirement already satisfied: ipywidgets in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (7.5.1)
Requirement already satisfied: nbconvert in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.6.1)
Requirement already satisfied: qtconsole in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.0.1)
Requirement already satisfied: ipykernel in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (4.10.1)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->ipython->sql_magic) (0.6.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython->sql_magic) (0.2.5)
Requirement already satisfied: jupyter-client in /usr/local/lib/python3.6/dist-packages (from jupyter-console->jupyter->sql_magic) (5.3.5)
Requirement already satisfied: jupyter-core>=4.4.0 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (4.7.0)
Requirement already satisfied: jinja2 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (2.11.2)
Requirement already satisfied: nbformat in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (5.0.8)
Requirement already satisfied: Send2Trash in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied: terminado>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.9.1)
Requirement already satisfied: tornado>=4 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (5.1.1)
Requirement already satisfied: widgetsnbextension~=3.5.0 in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied: pandocfilters>=1.4.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (1.4.3)
Requirement already satisfied: bleach in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (3.2.1)
Requirement already satisfied: testpath in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied: mistune<2,>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied: defusedxml in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied: entrypoints>=0.2.2 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied: qtpy in /usr/local/lib/python3.6/dist-packages (from qtconsole->jupyter->sql_magic) (1.9.0)
Requirement already satisfied: pyzmq>=17.1 in /usr/local/lib/python3.6/dist-packages (from qtconsole->jupyter->sql_magic) (20.0.0)
Requirement already satisfied: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from jinja2->notebook->jupyter->sql_magic) (1.1.1)
Requirement already satisfied: jsonschema!=2.5.0,>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbformat->notebook->jupyter->sql_magic) (2.6.0)
Requirement already satisfied: packaging in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (20.8)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied: pyparsing>=2.0.2 in /usr/local/lib/python3.6/dist-packages (from packaging->bleach->nbconvert->jupyter->sql_magic) (2.4.7)
Installing collected packages: findspark, sql-magic
Successfully installed findspark-1.4.2 sql-magic-0.0.4

In [8]:
# Load in the sql_magic support for our notebook
%reload_ext sql_magic

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

## Now, configure a connection to the google database server

In [9]:
%config SQL.conn_name = 'engine_imdb'

### And run an SQL command - Just put %% in front of the command

In [10]:
%%read_sql
# Let's see what databases are on this server
show databases

Query started at 10:15:32 PM UTC; Query executed in 0.02 m

             Database
0  information_schema
1        bike_sharing
2            citibike
3   citibike_fall2017
4            facebook
5                imdb
6               music
7     nypd_complaints
8              public
9         restaurants

In [11]:
%%read_sql 
# What is the table definition for the actors table?
 describe actors

Query started at 10:15:36 PM UTC; Query executed in 0.00 m

        Field          Type Null  Key Default Extra
0          id       int(11)   NO  PRI       0
1  first_name  varchar(100)  YES  MUL    None
2   last_name  varchar(100)  YES  MUL    None
3      gender       char(1)  YES         None

In [12]:
%read_sql select count(*) from actors;

Query started at 10:15:40 PM UTC; Query executed in 0.03 m

   count(*)
0    817718

# Switch to the class server at bigdata.stern.nyu.edu

In [13]:
conn_string_big = 'mysql://{user}:{password}@{host}:{port}/{db}?charset=utf8'.format(
    user='dealingF19GB10', 
    password='dealingF19GB10!!', 
    host = 'bigdata.stern.nyu.edu', 
    port=3306, 
    db='dealingF19GB10',
    encoding = 'utf-8'
)
# call this connection engine_big
engine_big = create_engine(conn_string_big)

In [14]:
# Tell sql magic the connection to use
%config SQL.conn_name = 'engine_big'

In [15]:
%%read_sql
show databases

Query started at 10:16:04 PM UTC; Query executed in 0.03 m

                      Database
0           information_schema
1                   DealingF19
2                          TMP
3                   dealingF19
4                dealingF19GB1
5               dealingF19GB10
6                dealingF19GB2
7                dealingF19GB3
8                dealingF19GB4
9                dealingF19GB5
10               dealingF19GB6
11               dealingF19GB7
12               dealingF19GB8
13               dealingF19GB9
14                    facebook
15                        imdb
16                   metastore
17                       mysql
18  nyc_restaurant_inspections
19          performance_schema
20                        rest
21                         tmp

In [16]:
%read_sql show tables

Query started at 10:16:11 PM UTC; Query executed in 0.01 m

  Tables_in_dealingF19GB10
0                 311calls
1                NYPDCALLS
2                 Stations
3                  mytable
4                 newtable
5                     test
6                 thetable

In [17]:
%read_sql select count(*) from Stations

Query started at 10:16:14 PM UTC; Query executed in 0.01 m

   count(*)
0       916

#   
#   
#   ALL DONE! We can connect to remote mysql databases from colab, and issue sql queries.
#

In [22]:
## Later we will connect from python to pull data from sql  database directly into python for analysis